import { RecordMeta } from "./record";

export interface Item extends RecordMeta {
  type: ItemType;
  label: string;
  description: string;
  charge: number;
  image: File | null;
  rollable: boolean;
}

export interface Inventory extends RecordMeta {
  type: ItemType;
  owner: string;
  label: string;
  description: string;
  charge: number;
  image: File;
}

export interface Market extends RecordMeta {
  type: ItemType;
  originalId: string;
  owner: {
    id: string;
    username: string;
    avatar: string;
  };
  label: string;
  description: string;
  charge: number;
  image: File;
  price: number;
  discount?: number;
}

export type Trade = {
  id: string;
  money: number;
  items: string[];
};

/**
 * @description
 * 1. effect - status
 * 2. roll   - type of game wheel roll
 * 3. item   - usable item
 * 4. other  - not usable item
 */
export type ItemType = "effect" | "item" | "roll" | "other";

export interface effectInterface {
  label: ItemLabel;
  type: "modal" | "effect";
  effect?: () => void;
  body?: (close: () => void) => ReactNode;
}

export type ItemLabel =
  | "Erection - NPC"
  | "Full of PILK"
  | "Mexican Runner"
  | "Retro Longplay"
  | "To be continued..."
  | "А у тебя что?"
  | "А я бы смог"
  | "Алтарь жертвоприношения"
  | "Арбуз"
  | "Арбус"
  | "Астролог"
  | "Благословление цыганского барона"
  | "Блудная косичка Сани"
  | "Браузерная шняга"
  | "Вакуум"
  | "Ведро"
  | "Ведро кончи"
  | "Ведро с Польпо"
  | "Ведьмин котел"
  | "Восьмибитная Крыса"
  | "Вот бы не Жека..."
  | "Выбор бумера"
  | "Выбор зумера"
  | "Гем Монтесумы"
  | "Гидразинокарбонилметилбромфенилдигидробенздиазепин"
  | "Гиря"
  | "Глюк матрицы"
  | "Два по цене одного"
  | "Держусь за бедрок"
  | "Добрая крыса"
  | "Долгая доставка"
  | "Дырявый сапог"
  | "Задачка для физиков"
  | "Запаянный Крысиный Сундук"
  | "Йокерге здесь закон"
  | "Кал"
  | "Карта Валет"
  | "Карта Дама"
  | "Карта Джокер"
  | "Карта Король"
  | "Карта с номером 10"
  | "Карта с номером 2"
  | "Карта с номером 3"
  | "Карта с номером 4"
  | "Карта с номером 5"
  | "Карта с номером 6"
  | "Карта с номером 7"
  | "Карта с номером 8"
  | "Карта с номером 9"
  | "Квантовая суперпозиция"
  | "Колода Карт"
  | "Комбо-кубик"
  | "Конфетка"
  | "Корона колесного короля"
  | "Красочная манга"
  | "Кредит"
  | "Кредитный чип Сбербанка"
  | "Крыса"
  | "Крыса Изгой"
  | "Крыса гой"
  | "Крыса наркоманка"
  | "Крысиное колесо"
  | "Крысиный алтарь"
  | "Крысиный отец"
  | "Крысиный тапок"
  | "Крысталлизатор"
  | "Кубик хуюбика"
  | "Курва бобер"
  | "Легендарный кал"
  | "Лимонная конфетка"
  | "Любимец публики"
  | "МЕГА колесо сансары"
  | "Мало букв"
  | "Мегамужик"
  | "Мечтательная крыса"
  | "Микро-мошна"
  | "Минус 8 чубриков"
  | "Много букв"
  | "Мошна в мошне"
  | "Налоговый инспектор"
  | "Наперсток удачи"
  | "Нахуя?"
  | "Нехочуха"
  | "Ну и моча!"
  | "Общая игра"
  | "Ой, извините"
  | "Очки EZ"
  | "Пакет конфеток"
  | "Пакет лимонных конфеток"
  | "Первопроходец"
  | "Платная педалька"
  | "По магазинам с чертями"
  | "Повязка Рэмбо"
  | "Подброшенная свинья"
  | "Подмена за кулисами"
  | "Посылка с алиэкспресса"
  | "Проклятый навигатор"
  | "Пустой пакет"
  | "Пшено"
  | "Ремонтный набор"
  | "Ромашка"
  | "Руки-крюки"
  | "Рыбий жир"
  | "Светлое нефильтрованное"
  | "Свиток реролла"
  | "Сексуальный Фландерс"
  | "Сильный бросок"
  | "Скальпель"
  | "Слабый бросок"
  | "Сорокалетний девственник"
  | "Спермовая удача"
  | "Страховка"
  | "Стул Трампа"
  | "Сужающееся колесо Фландерса"
  | "Таинственный предмет"
  | "Танец Хомяка: Эпический Расколбас Восприятия"
  | "Торопыжка"
  | "Тупорылый кот"
  | "Фальшивый чубрик"
  | "Флешка с играми"
  | "Хорадрический куб"
  | "Хрюкающая свинья"
  | "Хуишка"
  | "Цифровой выбор"
  | "Часовой рост"
  | "Читерский кубик"
  | "Шар всезнания"
  | "Шляпа"
  | "Штаны с крутыми карманами"
  | "Штрафная квитанция"
  | "Эфемерность"
  | "Я здесь закон"
  | "Я не тупой"
  | "Яйцо"
  | "сука гвозди"
  | "фрешмит"
  | "Большие яйца"
  | "S-блок"
  | "Алтарь обновления"
  | "Апельсин"
  | "Крысиный лутбокс"
  | "Ебануто живучая свинья"
  | "Тройной d4-кубик"
  | "Меч бесконечной лжи"
  | "Лещ"
  | "Легендарная Морковка"
  | "Колесная Фея"
  | "Клавиша «R»"
  | "Гремлинская залупа"
  | "Гремлинизатор"
  | "Гремлин"
  | "Свинский Сектор Приз"
  | "Страшная свиная история"
  | "Свинарник"
  | "Свин или не свин?"
  | "Свинство"
  | "СпецСвин"
  | "Свиная шляпа"
  | "Свинопитек"
  | "Свинья"
  | "Ластик"
  | "Крысавчик"
  | "Крысубль"
  | "Крысиная грамота"
  | "Крысиная раздача"
  | "Кредитка КрысПоинтБанка"
  | "Зелье Крысогеддона"
  | "Волшебный Крысиный Дождь"
  | "Белорусская Крыса"
  | "Борщ"
  | "Мета-кубик"
  | "Красная карточка"
  | "Двадцатый кубик"
  | "Крысенштекс"
  | "Помойная Крыса"
  | "Крысинариум"
  | "Проклятие Крысиного Короля"
  | "Благословление Крысиного Короля"
  | "Без мам и пап"
  | "Крысиная шкатулка";
