type QuestReward = {
  type: "item" | "money";
  value: string | number;
};

type Quest = {
  id: number;
  label: string;
  description: string;
  claimed: string[];
  reward: QuestReward[];
};

// Награды:
// 3. Родить
// 4. Приготовить человека
// 5. Найти 3 разных бага в одной игре
// 6. Проходить игру дольше 20 часов
// 7. Проходить игру меньше 1 часа
// 8. Крашнуть игру
// 9. Быть атакованным крысой
// 10. Пьяное вождение
// 11. Жекина игра
// 12. Аниме игра
// 13. Поймать ЛЮТУЮ рыбу
// 14. Пройти 3 игры одной франшизы
// 15. Приготовить человека
// 16. Услышать слово яйца (в контексте пэнис)
// 17. Сервера игры заблокированы на территории РФ
// 18. Канал Нейро-самы играл в эту игру
// 19. Удвоить свои деньги через азартные игры
// 20. Потерять все свои деньги через азартные игры
//
//  {
//   id: 3,
//   label: "",
//   description: "",
//   claimed: [],
//   reward: [
//     {
//       type: "",
//       value: "",
//     },
//   ],
// },

export const QuestsConfig: Quest[] = [
  {
    id: 1,
    label: "Страшилка",
    description: "Испугаться чего-то в игре",
    claimed: [],
    reward: [
      {
        type: "item",
        value: "Страшная свиная история",
      },
    ],
  },
  {
    id: 2,
    label: "Магнат (не мороженое)",
    description: "Получить миллион чего-либо",
    claimed: [],
    reward: [
      {
        type: "item",
        value: "Ебанутый дед",
      },
      {
        type: "money",
        value: 10,
      },
    ],
  },
  {
    id: 3,
    label: "Яжмать",
    description: "Родить",
    claimed: [],
    reward: [
      {
        type: "",
        value: "",
      },
    ],
  },
];
